Autodesk.Revit.DB.Structure.StickElementProjectionZ
Presets for given Analytical Projection.

Autodesk.Revit.DB.Structure.StickElementProjectionZ.Varies
Projection types are different at each end.

Autodesk.Revit.DB.Structure.StickElementProjectionZ.Plane
Use a Plane for projection (e.g., Grid, Level).

Autodesk.Revit.DB.Structure.StickElementProjectionZ.Bottom
Horizontally, corresponds to bottom of physical model.

Autodesk.Revit.DB.Structure.StickElementProjectionZ.Center
Horizontally, center of physical model.

Autodesk.Revit.DB.Structure.StickElementProjectionZ.Top
Horizontally, corresponds to top of physical model.

Autodesk.Revit.DB.Structure.StickElementProjectionZ.LocationLine
Location Line.